Revit 2027 API
IFCParameterTemplate.FindPropertyMappingInfo(PropertySetupType, String, String) Method
 Finds the property mapping info in the property set by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCPropertyMappingInfo FindPropertyMappingInfo(
	PropertySetupType propertySetupType,
	string propertySetName,
	string propertyName
)
Public Function FindPropertyMappingInfo (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	propertyName As String
) As IFCPropertyMappingInfo
public:
IFCPropertyMappingInfo^ FindPropertyMappingInfo(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	String^ propertyName
)
member FindPropertyMappingInfo :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        propertyName : string -> IFCPropertyMappingInfo
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
propertyName String
 The property name.
Return Value
IFCPropertyMappingInfo
 The property mapping info or null if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
FindPropertyMappingInfo Overload
Autodesk.Revit.DB Namespace